src/DataProcessors/НастройкаКонвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>НастройкаКонвертации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыОбменов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/ПравилаКонвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыОбменов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменЗапрещен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйРазмерПорции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииОтправителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВерсииПолучателя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/НастройкаКонвертации/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сравнить12(Команда)
	
	Результат = СравнитьНаСервере(Узел1, Узел2);
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Результат.ДанныеСтрокойИсх);
	Текст.Показать(Результат.ВерсияИсх);
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Результат.ДанныеСтрокойКон);
	Текст.Показать(Результат.ВерсияКон);
	
КонецПроцедуры

&НаКлиенте
Процедура Сравнить21(Команда)
	
	Результат = СравнитьНаСервере(Узел2, Узел1);
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Результат.ДанныеСтрокойИсх);
	Текст.Показать(Результат.ВерсияИсх);
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Результат.ДанныеСтрокойКон);
	Текст.Показать(Результат.ВерсияКон);
	
КонецПроцедуры

&НаСервере
Функция СравнитьНаСервере(Знач Отправитель, Знач Получатель)
	
	Отправитель = Отправитель.ПолучитьОбъект();
	Получатель = Получатель.ПолучитьОбъект();
	Отправитель.ОбновитьДанные();
	Получатель.ОбновитьДанные();
	
	ДанныеСтрокойИсх = Фастекс.ПолучитьОбъект(Отправитель, Объект.ИмяТипа, Объект.СсылкаСтрокой, Объект.Код, Объект.Наименование, Объект.Номер);
	Фастекс.ПодготовитьДанныеДляЗагрузки(Объект.ПланОбмена, Отправитель, Получатель, ДанныеСтрокойИсх);
	ДанныеСтрокойИсх = СтрЗаменить(ДанныеСтрокойИсх, "&lt;", "<");
	ДанныеСтрокойИсх = СтрЗаменить(ДанныеСтрокойИсх, "&gt;", ">");
	
	ДанныеСтрокойКон = Фастекс.ПолучитьОбъект(Получатель, Объект.ИмяТипа, Объект.СсылкаСтрокой, Объект.Код, Объект.Наименование, Объект.Номер);
	ДанныеСтрокойКон = СтрЗаменить(ДанныеСтрокойКон, "&lt;", "<");
	ДанныеСтрокойКон = СтрЗаменить(ДанныеСтрокойКон, "&gt;", ">");
	
	Возврат Новый Структура("ДанныеСтрокойИсх, ДанныеСтрокойКон, ВерсияИсх, ВерсияКон", ДанныеСтрокойИсх, ДанныеСтрокойКон, Отправитель.Версия, Получатель.Версия);
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокТипов()
	
	Массив = Фастекс.СоставОчереди(Объект.ПланОбмена, Узел2);
	Элементы.ИмяТипа.СписокВыбора.ЗагрузитьЗначения(Массив);
	Элементы.ИмяТипа.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланОбменаПриИзменении(Элемент)
	
	ОбновитьСписокТипов();
	ПриИзмененииУзлов();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииУзлов()
	
	ПравилоКонвертации1 = Неопределено;
	ПравилоКонвертации2 = Неопределено;
	
	Если НЕ Узел1.Пустая() И НЕ Узел2.Пустая() И НЕ Узел1.Версия = Узел2.Версия Тогда
		Правила = Справочники.ПравилаКонвертации.ПолучитьПравила(Объект.ПланОбмена, Узел1.Версия, Узел2.Версия);
		стр = Правила.Найти(Объект.ИмяТипа);
		Если НЕ стр = Неопределено Тогда
			ПравилоКонвертации1 = стр.ссылка;
		КонецЕсли;
		
		Правила = Справочники.ПравилаКонвертации.ПолучитьПравила(Объект.ПланОбмена, Узел2.Версия, Узел1.Версия);
		стр = Правила.Найти(Объект.ИмяТипа);
		Если НЕ стр = Неопределено Тогда
			ПравилоКонвертации2 = стр.ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ПравилоКонвертации1.Доступность =  НЕ Узел1.Версия = Узел2.Версия И НЕ Узел1.Пустая() И НЕ Узел2.Пустая();
	Элементы.ПравилоКонвертации2.Доступность =  НЕ Узел1.Версия = Узел2.Версия И НЕ Узел1.Пустая() И НЕ Узел2.Пустая();
	
КонецПроцедуры

&НаКлиенте
Процедура Узел1ПриИзменении(Элемент)
	ПриИзмененииУзлов();
КонецПроцедуры

&НаКлиенте
Процедура Узел2ПриИзменении(Элемент)
	ПриИзмененииУзлов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСписокТипов();
	ПриИзмененииУзлов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВерсияУзла(Узел)
	Возврат Узел.Версия;
КонецФункции

&НаКлиенте
Процедура ПравилоКонвертации1Открытие(Элемент, СтандартнаяОбработка)
	
	Если ПравилоКонвертации1.Пустая() Тогда
		ФормаПравила = ПолучитьФорму("Справочник.ПравилаКонвертации.Форма.ФормаЭлемента", , ЭтотОбъект);
		ФормаПравила.Объект.ПланОбмена = Объект.ПланОбмена;
		ФормаПравила.Объект.ИмяТипа = Объект.ИмяТипа;
		ФормаПравила.Объект.ВерсииОтправителя.Добавить().Версия = ВерсияУзла(Узел1);
		ФормаПравила.Объект.ВерсииПолучателя.Добавить().Версия = ВерсияУзла(Узел2);
		ФормаПравила.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоКонвертации2Открытие(Элемент, СтандартнаяОбработка)
	
	Если ПравилоКонвертации2.Пустая() Тогда
		ФормаПравила = ПолучитьФорму("Справочник.ПравилаКонвертации.Форма.ФормаЭлемента");
		ФормаПравила.Объект.ПланОбмена = Объект.ПланОбмена;
		ФормаПравила.Объект.ИмяТипа = Объект.ИмяТипа;
		ФормаПравила.Объект.ВерсииОтправителя.Добавить().Версия = ВерсияУзла(Узел2);
		ФормаПравила.Объект.ВерсииПолучателя.Добавить().Версия = ВерсияУзла(Узел1);
		ФормаПравила.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТипаПриИзменении(Элемент)
	ПриИзмененииУзлов();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПримерНаСервере()
	
	Объект.СсылкаСтрокой = Фастекс.ПолучитьПример(Узел2.ПолучитьОбъект(), Объект.ИмяТипа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПример(Команда)
	ПолучитьПримерНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбменНаСервере()
	
	ИмяТипа = Объект.ИмяТипа;
	ИмяТипа = СтрЗаменить(ИмяТипа, "CatalogObject", "Справочник");
	ИмяТипа = СтрЗаменить(ИмяТипа, "DocumentObject", "Документ");
	ИмяТипа = СтрЗаменить(ИмяТипа, "InformationRegisterRecordSet", "РегистрСведений");
	ИмяТипа = СтрЗаменить(ИмяТипа, "AccumulationRegisterRecordSet", "РегистрНакопления");
	ИмяТипа = СтрЗаменить(ИмяТипа, "AccuountingRegisterRecordSet", "РегистрБухгалтерии");
	
	Фастекс.ВыполнитьОбменПоВидуОбъектов(Объект.ПланОбмена.ПолучитьОбъект(), Узел1.ПолучитьОбъект(), Узел2.ПолучитьОбъект(), ИмяТипа, 3);
	Фастекс.ВыполнитьОбменПоВидуОбъектов(Объект.ПланОбмена.ПолучитьОбъект(), Узел2.ПолучитьОбъект(), Узел1.ПолучитьОбъект(), ИмяТипа, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура Обмен(Команда)
	ОбменНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ПриИзмененииУзлов();
КонецПроцедуры
